{
  "id": 3002,
  "name": "Infrastructure Issues & Outages",
  "description": "High-severity filter for live production-impacting infrastructure problems: outages, service unavailability, regional degradation, critical performance regressions, data-plane failures, and urgent remediation actions. Excludes routine operations, scheduled maintenance, informational updates, healthy status reports, internal engineering planning, and non-urgent workflow chatter.",
  "enabled": false,
  "threshold": 0.62,
  "positive_weight": 1.0,
  "negative_weight": 0.26,
  "positive_samples": [
    "Critical: production API error rates spiked from 0.3% to 28% in the last five minutes—investigation underway.",
    "Alert: authentication service is fully unavailable, login attempts failing globally.",
    "URGENT: database cluster experiencing failover loop; reads and writes stalled across all shards.",
    "Incident declared: EU region reporting 60% latency increase and intermittent 5xx across core endpoints.",
    "Production deploy rollback in progress due to persistent request timeouts impacting customer transactions.",
    "High severity: message queue backlog growing uncontrollably, consumers failing to process messages.",
    "Gateway routing failure: 40% of traffic receiving malformed responses, incident response engaged.",
    "Network partition detected between core services and storage backend, causing cascading failures.",
    "Hotfix required: corrupted cache entries causing incorrect data served to live users.",
    "Pager triggered: autoscaling group stuck in unhealthy state—instances failing startup consistently.",
    "Live incident: file storage returning intermittent 500s, impacting user uploads and media retrieval.",
    "Production job scheduler malfunctioning—critical workflows not executing as expected.",
    "Service mesh experiencing routing instability, causing intermittent service unreachable errors.",
    "Major outage: payment processing pipeline halted due to upstream dependency timeouts.",
    "Critical degradation: real-time analytics pipeline losing >30% of events due to worker crashes.",
    "Persistent error: TLS certificate misconfiguration blocking production traffic in APAC.",
    "Backend CPU saturation on primary nodes causing immediate production traffic throttling.",
    "Data corruption detected in live environment—writes temporarily disabled to prevent further damage.",
    "DNS misconfiguration propagating externally—customers unable to resolve our API endpoints.",
    "Production Kafka cluster unreachable; producers failing and retry queues overflowing.",
    "Full outage: container orchestration control plane down; cannot schedule or restart services.",
    "Incident: memory leak causing sequential service crashes every 15 minutes in the core API.",
    "Partial outage: CDN edge nodes returning 503 for static assets in multiple regions.",
    "Firewall rules pushed incorrectly—external traffic blocked across all environments.",
    "Storage cluster hitting I/O saturation, blocking read/writes and causing API stalls.",
    "Critical alarm: replication lag exceeds 2 hours on primary DB—eventual consistency breaking assumptions.",
    "Service degradation: content indexing service not updating, causing stale results to users.",
    "Realtime feature flag service failing to propagate updates—critical configurations stale.",
    "Major data-plane issue: internal RPC calls timing out between microservices.",
    "Backend container crash loops triggered by misconfigured secrets in production.",
    "Production Redis cluster eviction spike causing missing session data.",
    "Global outage triggered by expired authentication token for internal service-to-service traffic.",
    "API throttling incorrectly applied to premium customers due to configuration drift.",
    "Production ETL pipeline stuck; no data delivered to analytics dashboard for last 3 hours.",
    "High alert: live traffic exceeding capacity limits—emergency scale-up blocked by provisioning error.",
    "Persistent disk failures detected on primary storage nodes—risk of data loss.",
    "Deployment rollback failed, leaving partial version mismatch across services.",
    "Production rate limiter malfunctioning, denying legitimate user requests.",
    "Critical: service experiencing heap exhaustion, causing cascading JVM restarts."
  ],
  "negative_samples": [
    "Daily status: all monitoring dashboards look normal today.",
    "Reminder: scheduled maintenance window tomorrow at 1 AM.",
    "Monthly uptime report showing stable 99.95% availability.",
    "Completed upgrade of staging environment—no production impact.",
    "Metrics dashboards updated with new visualizations.",
    "Success: background batch job completed earlier than expected.",
    "Routine maintenance: rotating logs and clearing unused temp files.",
    "SRE note: we're planning load tests next week.",
    "Infrastructure cost optimization discussion.",
    "Refactoring Terraform modules for easier management.",
    "Updating Helm charts to use the latest image tags in staging.",
    "Engineering chat: “Should we move to a different metrics backend?”",
    "Informational: deployed minor config change with no user impact.",
    "Healthy heartbeat check: all services passing probes.",
    "QA environment is down for testing—expected and non-critical.",
    "Discussion about on-call rotations for next quarter.",
    "General question: how do I connect to the dev cluster?",
    "Non-critical alert: CPU spike observed but auto-scaled correctly.",
    "Planning doc: migrating to new instance types next quarter.",
    "Announcement: backups completed successfully overnight.",
    "Cluster resize completed in staging—no incidents.",
    "Security update: reviewing TLS policies next sprint.",
    "Email: we added new dashboards to Grafana.",
    "Success message: canaries passed, rollout continues.",
    "Low urgency: small increase in latency during scheduled benchmark tests.",
    "Team discussion about using gRPC vs REST in future services.",
    "Internal message: “We updated the CI/CD pipeline workflow.”",
    "Informational blog post on SRE best practices.",
    "Updating dependency versions for the dev environment.",
    "Support note: user reported app bug that is not infra-related.",
    "Reminder to rotate SSH keys by end of the month.",
    "Scheduled internal network maintenance confirmed for this weekend.",
    "Weekly infra meeting notes—no incidents reported.",
    "Testing new autoscaling configuration in sandbox environment.",
    "General cloud provider news update with no production impact.",
    "Team discussion about improving logs for easier debugging.",
    "Informational: deprecated API endpoints removed from staging.",
    "Documentation update: new on-call playbooks added.",
    "Customer reporting UI bug—backend unaffected.",
    "Internal policy update for secrets rotation.",
    "Question about recommended sizing for development environments.",
    "Slack thread discussing improvements to observability tooling.",
    "Infrastructure migration proposal draft for review."
  ],
  "channels": [],
  "users": [],
  "vip_senders": [],
  "webhooks": [],
  "excluded_users": [],
  "reaction_threshold": 5,
  "reply_threshold": 3,
  "tags": [
    "devops",
    "sre",
    "infrastructure",
    "incidents",
    "outages",
    "degradation",
    "production",
    "severity1",
    "critical-issue"
  ],
  "digest": {
    "schedules": [
      {
        "schedule": "hourly",
        "top_n": 10,
        "min_score": 0.62,
        "mode": "dm"
      }
    ]
  }
}
