{
  "id": 3009,
  "name": "Market Intelligence & Trends",
  "description": "Strategic market and competitive intelligence: non-routine signals about market structure, competitor moves, customer/industry trends, and analyst/market reports that leadership should be briefed on. Excludes routine stock chatter, generic news, and day-to-day operational updates.",
  "enabled": false,
  "threshold": 0.55,
  "positive_weight": 1.0,
  "negative_weight": 0.25,
  "positive_samples": [
    "New Gartner report positions our main competitor as a Leader in the cloud security quadrant, signaling increased pressure in the enterprise segment.",
    "IDC forecasts 27% CAGR for zero-trust network solutions in EMEA over the next 3 years, with strong growth in regulated industries.",
    "Competitor X just announced a bundled pricing strategy that undercuts our mid-market offer by 20% while adding premium support.",
    "Industry survey shows 65% of CIOs plan to increase AI infrastructure spending despite broader IT budget freezes.",
    "European regulator consultation hints at tighter data residency rules that could favor local cloud providers over US hyperscalers.",
    "Emerging trend: mid-size manufacturers increasingly prefer vertical-specific SaaS platforms over generic ERP suites.",
    "New entry in our category: YC-backed startup offering usage-based billing for observability tooling, targeting our SMB wedge.",
    "Analyst briefing suggests that consolidation is accelerating in the identity management space, with 3–4 major platforms likely to dominate.",
    "Large customer RFPs are starting to require sustainability and carbon reporting features as a core evaluation criterion.",
    "Competitor's latest earnings call emphasized a strategic pivot from one-off licenses to fully usage-based contracts in the enterprise segment.",
    "Recent procurement data indicates rising adoption of multi-cloud security solutions rather than single-cloud native tools.",
    "Industry benchmark shows that API-first vendors are winning more greenfield deals in fintech compared to suite-based providers.",
    "Survey of 500 CISOs indicates growing appetite for consolidated security platforms, reducing the number of point solutions.",
    "Emerging pattern: customers are standardizing on a single data lake vendor and replacing specialized analytics tools.",
    "Major cloud provider announced a new marketplace rebate program that could attract more ISVs into their ecosystem.",
    "Competitor Y launched an AI co-pilot for admins, explicitly targeting manual workflows that our current product does not automate.",
    "New legislation in APAC mandates data localization for financial records, which may require regional deployments for key accounts.",
    "Large systems integrator released a trend report recommending contract intelligence solutions as a top investment area.",
    "Industry conference keynote focused heavily on AI-assisted observability, indicating a shift in mainstream expectations.",
    "Our main rival has started offering 24-month price locks in multi-year deals, signaling an aggressive land-grab strategy.",
    "Regional telcos are packaging cloud security services into their connectivity bundles, creating a new distribution channel.",
    "Quarterly VC funding data shows increased investment in privacy-preserving analytics platforms compared to generic BI tools.",
    "Analyst downgrade of legacy on-prem solutions cites rapid migration to cloud-native alternatives in our core vertical.",
    "Customer interviews reveal a growing preference for vendors that offer integrated compliance and audit reporting out of the box.",
    "RFP language in public tenders increasingly references zero trust architectures rather than traditional perimeter security.",
    "Global supply chain risk reports predict higher demand for real-time risk monitoring software in logistics and manufacturing.",
    "Competitor Z is piloting a free tier with hard usage caps to accelerate adoption among developers in our target accounts.",
    "Industry group whitepaper suggests that open standards for event streaming will reduce lock-in to single-vendor platforms.",
    "Market share estimates show our category expanding into mid-market segments that historically relied on spreadsheets.",
    "Partner ecosystem data indicates hyperscalers actively recruiting vendors with strong AI/ML capabilities in security.",
    "Competitor earnings transcript reveals slower growth in SMB and a strategic focus shift toward large enterprise accounts.",
    "Regional digitalization programs in LATAM are subsidizing cloud adoption, potentially creating new public sector demand.",
    "Market trend: buyers are increasingly requesting SOC 2 + ISO 27001 as baseline requirements in RFP security sections.",
    "Large enterprise buyers are moving from pay-per-user to pay-per-transaction pricing models, impacting margin structures.",
    "Cyber insurance underwriters are starting to require specific security controls that align with our product strengths.",
    "New EU guidance on AI transparency could disadvantage opaque black-box ML vendors in our analytics segment.",
    "Channel partners report increased pull-through demand for integrated observability + incident response bundles.",
    "Industry association data shows that average deal cycles in our category are shortening for vendors with pre-approved frameworks.",
    "Survey of procurement leaders indicates a shift toward fewer strategic vendors per category to simplify governance.",
    "Top competitor has entered the APAC mid-market via an exclusive distribution partnership with a major regional reseller.",
    "Public product roadmap from a rival signals upcoming expansion into contract analytics, overlapping with our roadmap.",
    "Cloud provider marketplace listings show faster growth in security automation offerings than in traditional SIEM tools.",
    "Trend alert: enterprise buyers increasingly expect native integrations with low-code platforms when evaluating solutions.",
    "Economic outlook reports suggest that cost-optimization tooling will see counter-cyclical growth during IT budget cuts.",
    "Competitor has quietly updated their terms to include outcome-based pricing pilots for select lighthouse customers.",
    "Industry research highlights a shift from feature comparisons to total cost of ownership and time-to-value in RFP scoring.",
    "New regulatory reporting requirement is driving demand for automated audit trails across financial services platforms.",
    "Analyst firm names contract lifecycle management as a top 3 category for AI augmentation over the next 24 months.",
    "High churn among legacy tool vendors in our space points to dissatisfaction with outdated UX and limited automation.",
    "Trend: security and compliance ownership is moving from IT to cross-functional risk committees in large enterprises.",
    "Large government program has earmarked significant funding for cloud modernization, including observability solutions.",
    "Procurement databases show more tenders requesting single-vendor platforms that combine monitoring and incident response.",
    "Competitor has introduced vertical-specific editions (healthcare, financial services) with tailored compliance features.",
    "VC memo leak indicates strong investor conviction in AI-powered code security, with several new entrants in the space.",
    "Industry analysts expect a wave of M&A in developer tooling as platforms seek to own more of the SDLC.",
    "Customer feedback in public forums shows that buyers now expect out-of-the-box dashboards for board-level reporting.",
    "Reports from implementation partners suggest that time-to-value is a key differentiator in competitive evaluations.",
    "Public hiring data reveals that key competitor is building a dedicated go-to-market team for the public sector.",
    "Emerging trend: RFPs increasingly ask for native integrations with leading SIEM and SOAR platforms.",
    "Market maps from top VCs now classify our category as a distinct segment rather than a sub-feature of broader suites.",
    "Cross-industry benchmarks show growing demand for real-time anomaly detection versus batch analytics in operations.",
    "Industry newsletter highlights multiple large enterprises replacing custom-built solutions with off-the-shelf platforms.",
    "Competitor partnerships with global SIs suggest a strategy to target complex multi-region rollouts in our segment.",
    "Economic downturn commentary from analysts predicts increased demand for tools that reduce headcount dependence.",
    "Regulatory enforcement actions in our space are spurring demand for more robust audit and logging capabilities.",
    "Regional data privacy frameworks diverging from GDPR may fragment vendor compliance strategies, impacting go-to-market.",
    "Signals from procurement teams indicate a move away from perpetual licenses toward OPEX-friendly subscription models."
  ],
  "negative_samples": [
    "Our stock went up 3% today, good job team!",
    "What stocks should I buy for my personal portfolio this month?",
    "The NASDAQ is down this morning, anyone worried?",
    "FYI: daily market open/close summary attached.",
    "Article about general economic inflation trends with no mention of our category or competitors.",
    "Random news link: \"Tech company CEO interviews about his career journey\" with no strategic market insight.",
    "Discussion on employee headcount planning for our internal teams.",
    "Conversation about updating our internal Jira workflow and sprint cadence.",
    "Reminder: submit your quarterly goals in the HR system.",
    "General business article on leadership habits with no reference to industry structure or competition.",
    "Link to a generic Forbes piece on entrepreneurship with no specific market or trend relevance.",
    "Team chat: \"We should celebrate Q2 with a team dinner, revenue looks good!\"",
    "Internal note: \"Marketing budget for next quarter has been approved.\"",
    "Question: \"How do I get VPN access to the office network?\"",
    "General IT support ticket: laptop not working, need replacement.",
    "Discussion of our internal pricing approval workflow without reference to competitor pricing or market dynamics.",
    "Email about office relocation and new seating plan.",
    "Announcement: \"New expense policy for travel and meals.\"",
    "Comment: \"The economy seems tough lately\" with no actionable data or industry context.",
    "Slack thread sharing a generic motivational article about innovation.",
    "Finance report discussing internal cost overruns for a specific project without market comparison.",
    "Discussion on our social media calendar (which posts to schedule and when).",
    "Customer support ticket about a single bug with no trend across accounts.",
    "Internal roadmap discussion about prioritizing a feature without any external market references.",
    "Personal opinion: \"I think AI is the future\" with no data, vertical, or structured trend signal.",
    "Internal survey about employee engagement and satisfaction.",
    "FAQ response: \"How do I reset my SSO password?\"",
    "Meeting recap: \"We decided to ship feature X next sprint\" with no link to market or competitive context.",
    "News about a tech celebrity scandal unrelated to our category or industry structure.",
    "Macroeconomic commentary like \"recession fears increasing\" without tying to our buyers or market segment.",
    "Weekly sales pipeline hygiene reminder with no strategic analysis.",
    "Generic newsletter: \"Top 10 productivity tools\" not focused on our domain or buyers.",
    "Internal engineering note about refactoring a microservice with no customer or market impact discussion.",
    "A tweet about crypto prices with no relevance to our target markets or product.",
    "General guidance from HR on remote work policies.",
    "This quarter's office renovation plan and seating layout proposals.",
    "Discussion about our booth logistics for a conference (shipping, swag, staff schedules).",
    "Customer complaint about an isolated billing error, not part of a broader pattern.",
    "Request: \"Can someone approve my timesheet?\"",
    "Story about a startup acquisition in a completely unrelated sector (e.g., food delivery) with no analogy or lesson drawn.",
    "Email: \"Here is the updated org chart\" with no competitive or market context.",
    "Internal training schedule for new hires on company policies.",
    "Slack poll asking which project management tool people prefer for internal use.",
    "Discussion about code style guidelines and linting rules.",
    "Notification about office internet downtime and IT maintenance.",
    "Weekly product demo invite to internal stakeholders only, with no external positioning or market framing.",
    "One-off customer escalation about contract wording not linked to a trend across deals.",
    "Brainstorm on internal team branding and name changes.",
    "Update: \"We renewed our office lease for another year\".",
    "Newsletter about general workplace wellness tips.",
    "Conversation about holiday schedule and office closures.",
    "General link to \"Top marketing campaigns of the year\" unrelated to our product category or buyer.",
    "Question: \"Which CRM fields are mandatory for opportunity creation?\"",
    "Generic TED talk about leadership with no takeaway for our market or competition.",
    "Update on internal technical debt backlog, without external drivers mentioned.",
    "Discussion about which video conferencing tool to standardize on.",
    "Random news: \"Sports team X wins the championship\".",
    "Broad headline: \"Tech stocks rally today\" with no category-specific insight.",
    "Email thread about internal compliance training completion rates.",
    "Reminder about quarterly performance review cycle.",
    "Team debate on code editor preferences (VS Code vs. JetBrains).",
    "General market index snapshot shared without any analysis or relevance to our space.",
    "Internal design review of UI colors and iconography unrelated to competitive differentiation.",
    "Slack message: \"Our LinkedIn post got 500 likes!\" with no insight into target ICP or market traction.",
    "Chat about choosing a venue for the next offsite.",
    "Internal-only hackathon ideas focusing on fun projects without clear market linkage.",
    "One-off deal win celebration that doesn’t mention why we won versus competitors or what it signals for the market.",
    "Procurement email approving a new internal SaaS tool for HR use.",
    "A tech blog about generic cloud concepts with no competitive or segment-specific angle.",
    "Conversation around internal cost-cutting measures not tied to market movements or external pressures.",
    "What stocks should I buy?",
    "Market is up today",
    "TO THE MOON 🚀🚀🚀",
    "Daily market open/close",
    "Generic business news",
    "HODL diamond hands 💎👐",
    "Bullish! 🚀",
    "Wen moon? When lambo?",
    "Pump it! LFG!",
    "This is huge! Game changer!",
    "100x incoming"
  ],
  "channels": [],
  "users": [],
  "vip_senders": [],
  "webhooks": [],
  "excluded_users": [],
  "reaction_threshold": 15,
  "reply_threshold": 8,
  "tags": [
    "market",
    "intelligence",
    "trends",
    "competitive",
    "strategy",
    "competitive_intel",
    "industry_reports",
    "analyst_insights",
    "regulatory_trends"
  ],
  "digest": {
    "schedules": [
      {
        "schedule": "weekly",
        "weekly_day": 1,
        "weekly_hour": 8,
        "top_n": 25,
        "min_score": 0.55
      }
    ]
  }
}
