{
  "id": 3007,
  "name": "Strategic Partnerships & M&A",
  "description": "Surfaces concrete, high-value partnership, fundraising, and acquisition activity relevant to corporate development (e.g., M&A, strategic alliances, major capital raises).",
  "enabled": false,
  "threshold": 0.77,
  "positive_weight": 1.0,
  "negative_weight": 0.12,
  "positive_samples": [
    "We just signed an LOI to acquire Acme Labs; due diligence starts next week.",
    "Board approved the acquisition of NovaTech for $650M in cash and stock.",
    "Company X to be acquired by Company Y in an all-stock merger valued at $3.2B.",
    "Exploring a majority stake investment in a leading fintech as a strategic acquisition.",
    "We are evaluating three acquisition targets in the APAC region for market entry.",
    "Term sheet signed for strategic minority investment in our key infrastructure provider.",
    "Strategic partnership finalized with Microsoft to co-sell our solution in EMEA.",
    "Joint venture established with Tata to build and operate a new data center network.",
    "Exclusive distribution agreement signed with a top-tier European channel partner.",
    "Definitive agreement signed to acquire the assets of our main competitor in Germany.",
    "We received a non-binding offer to acquire our healthcare division.",
    "Corp Dev is kicking off diligence on a potential bolt-on acquisition in logistics.",
    "We are in advanced merger talks with our closest rival in the mid-market segment.",
    "Term sheet executed for a strategic alliance with AWS including co-marketing funds.",
    "Announcing a long-term OEM partnership to embed our technology in PartnerCo’s devices.",
    "We closed a $120M Series C round led by a strategic investor from our industry.",
    "Strategic investor SoftBank to lead our $300M growth equity financing.",
    "Board reviewing a proposal for a leveraged buyout of our public shares.",
    "Considering a carve-out sale of our underperforming consumer division.",
    "Signed a binding agreement to spin off our payments business via a sale to PrivateEquityCo.",
    "Corp dev request: shortlist acquisition candidates in cybersecurity with ARR > $20M.",
    "We are negotiating an exclusive licensing and distribution deal with a global pharma.",
    "Strategic reseller agreement executed with our largest systems integrator partner.",
    "M&A update: data room is open and bidders are starting confirmatory diligence.",
    "We have mandated Goldman Sachs to run a formal sale process for the company.",
    "The company received multiple acquisition approaches from strategic buyers.",
    "Launching a corporate venture arm to take minority stakes in strategic startups.",
    "We’re leading the Series B round in a partner startup to strengthen our ecosystem.",
    "Signed a multi-year strategic collaboration agreement to co-develop AI models.",
    "Acqui-hire: we are acquiring the engineering team of a small ML startup.",
    "Management discussing whether to pursue a merger of equals with a regional competitor.",
    "Executed a share purchase agreement to acquire 80% of a Brazilian distributor.",
    "Finalizing a cross-licensing and strategic cooperation agreement with a hardware OEM.",
    "Investor update: closing a $50M strategic funding round from one of our key partners.",
    "We’re entering a strategic go-to-market alliance with Salesforce AppExchange partner X.",
    "Strategic white-label partnership signed: PartnerCo will rebrand and sell our platform.",
    "M&A pipeline review: three active deals in diligence, two in LOI negotiation.",
    "Considering divesting our on-prem business line through an asset sale.",
    "The board approved creating a JV with TelcoCo to roll out 5G services.",
    "We won’t renew the current alliance; evaluating replacement strategic partners.",
    "Our corporate development team is negotiating earnout terms on the latest acquisition.",
    "We received a binding offer from a private equity fund to take us private.",
    "We are assessing buy vs. build vs. partner options for entering the payments space.",
    "Strategic co-marketing partnership closed with a top-tier cloud provider.",
    "Signed a memorandum of understanding (MOU) for a potential cross-border merger.",
    "Formal RFP launched to investment banks for potential sale or recapitalization.",
    "We’re negotiating board observer rights as part of a strategic investment.",
    "Corp dev request: please summarize all current strategic partnership negotiations.",
    "Update: closing conditions for the merger have all been satisfied; integration planning begins.",
    "Exclusive technology integration partnership signed with our largest ISV partner."
  ],
  "negative_samples": [
    "We need to improve our customer acquisition cost this quarter.",
    "Marketing is planning a new customer acquisition campaign on social media.",
    "Please review the draft blog post about our culture and company values.",
    "We’re hiring a Head of M&A to build out the team next year.",
    "Open role: Director of Strategic Partnerships for EMEA.",
    "Can someone share best practices for post-merger integration? (training webinar, no deal in play).",
    "Here are the slides for tomorrow’s webinar on M&A strategy in tech.",
    "Brainstorming session about long-term product strategy and roadmap.",
    "We should partner more closely with Sales to improve lead quality.",
    "Let’s find local partners to sponsor the upcoming hackathon.",
    "Our charity team is fundraising for the annual NGO initiative.",
    "We need to acquire more laptops and monitors for the new hires.",
    "Legal is reviewing the new data processing agreement with our vendor.",
    "Security completed vendor risk assessment on a new SaaS provider.",
    "Reminder: team offsite next month to discuss company strategy.",
    "This article about famous mergers is interesting; sharing for reference only.",
    "The marketing team wants to co-host a podcast with another brand.",
    "Could we partner with HR to improve internal communications?",
    "Support ticket: the partner portal login is not working.",
    "We added a new self-service integration with Slack in our app.",
    "Customer success is organizing a webinar for partners on how to use the dashboard.",
    "We need volunteers for the fundraising run for a local school.",
    "I’m considering acquiring some Tesla stock for my personal portfolio.",
    "Finance wants to review our capital allocation and budgeting process.",
    "Discussion about updating the commission plan for channel partners.",
    "We should increase our presence in partners’ marketplaces with better listings.",
    "General networking event with startups and investors next Thursday.",
    "Looking for potential partners to exchange content and backlinks.",
    "Our new partner logo wall on the website needs updating.",
    "Engineering is partnering with Design on the new UI refresh.",
    "We acquired three new enterprise customers this month.",
    "Let’s discuss strategies to acquire more free trial users.",
    "The training tomorrow covers basic M&A terminology for new employees (no specific deals).",
    "I’m reading a book about successful mergers and acquisitions in history.",
    "Reminder: submit your ideas for innovation and growth initiatives.",
    "We are negotiating discounts with a software vendor for internal use only.",
    "Please schedule a meeting with our marketing partner about the upcoming campaign.",
    "Updating the spreadsheet that tracks all partner contacts and tiers.",
    "The sales team wants to run a joint webinar with a small agency partner.",
    "We’re exploring partnerships for event sponsorships at the next conference.",
    "Customer feedback: they want more integrations with CRM tools.",
    "Discussion about lowering our CAC and improving LTV ratios.",
    "Setting up a partner certification program for consultants.",
    "Reviewing the draft article on why strategic partnerships matter in general.",
    "I need help drafting a LinkedIn post about our partner ecosystem (no specific deal).",
    "Company update: no M&A plans this year; focus is on organic growth.",
    "We are redesigning the partner portal UX to be more intuitive.",
    "Please upload the signed NDA with the prospective vendor.",
    "Internal workshop on how to build relationships with channel partners.",
    "Survey going out to our partner network about event preferences.",
    "Creating playbooks for partner managers around deal registration.",
    "Our charity partnership with a local nonprofit continues this year.",
    "We’re sponsoring a partner’s booth at the upcoming trade fair.",
    "Can someone recommend a good course on corporate finance and M&A concepts?",
    "We just launched a partner referral program for existing customers.",
    "Slack channel created for cross-team collaboration with the marketing agency.",
    "Discussion about rebranding our partner program tiers (Silver, Gold, Platinum).",
    "We acquired some new software licenses for internal BI tools."
  ],
  "channels": [],
  "users": [],
  "vip_senders": [],
  "webhooks": [],
  "excluded_users": [],
  "reaction_threshold": 12,
  "reply_threshold": 6,
  "tags": [
    "business",
    "strategy",
    "m&a",
    "partnerships",
    "corp-dev",
    "fundraising",
    "alliances"
  ],
  "digest": {
    "schedules": [
      {
        "schedule": "daily",
        "daily_hour": 10,
        "top_n": 10,
        "min_score": 0.77
      }
    ]
  }
}
