{
  "id": 3000,
  "name": "Product Launches & Announcements",
  "description": "Surfaces concrete, externally relevant product launches and major feature announcements so go-to-market teams stay aligned.",
  "enabled": false,
  "threshold": 0.75,
  "positive_weight": 1.0,
  "negative_weight": 0.2,
  "positive_samples": [
    "We are excited to announce the public launch of our new analytics dashboard, now available to all customers.",
    "Today we’re releasing version 3.0 of our platform with a completely redesigned UI and real-time collaboration.",
    "Official announcement: our new mobile app is now live on the iOS and Android app stores.",
    "Product launch: the new Enterprise tier is now available for purchase on our pricing page.",
    "We’re rolling out a major new feature: automated reporting is now live for all Pro customers.",
    "Big news: our AI-powered recommendation engine is now generally available.",
    "We’re introducing our latest product line, CloudSecure, to help enterprises secure multi-cloud workloads.",
    "Proud to announce the beta release of our new API, now open to selected customers.",
    "We have just launched a new integration with Salesforce that is now available in our marketplace.",
    "Public announcement: our self-service onboarding experience is now live for all new signups.",
    "The new billing portal is officially launched and enabled for all customers today.",
    "We’re unveiling our new customer-facing status page, now accessible on our website.",
    "Our new multi-region deployment capability is now generally available for all Enterprise plans.",
    "Announcing the official release of our Slack app—customers can install it starting today.",
    "We’ve launched a completely new onboarding flow to all users as part of the 2.5.0 release.",
    "The long-awaited dark mode feature is now live and available in the latest app update.",
    "We are publicly launching our EU data center option for all new and existing customers.",
    "Today we’re releasing our new analytics module, which is now included in the Business plan.",
    "Our redesigned reporting suite is officially launched and accessible in the dashboard.",
    "We’re announcing the general availability of SSO support for Okta and Azure AD.",
    "The new in-app messaging feature is now live globally after today’s deployment.",
    "Announcing our new partner marketplace, which goes live on the website today.",
    "We’re launching our first AI copilot feature, now available in the latest product update.",
    "Our new usage-based pricing model is now live and active for all future signups.",
    "We’re rolling out the global release of our live chat widget to all customer accounts.",
    "Product announcement: our Kubernetes operator is now available as an official release.",
    "We are releasing our new audit logging capabilities, now live for Enterprise tenants.",
    "Our new public API documentation site is launched and accessible at the main domain.",
    "The updated mobile experience with offline mode is now live in version 4.1.",
    "Announcing our new developer portal, launched today for external devs and partners.",
    "We just launched a new security feature: mandatory 2FA for admin accounts is now available.",
    "Feature launch: users can now export their full workspace data directly from the UI.",
    "The new organization-level dashboard is now live and visible to all org admins.",
    "We’re announcing the launch of our integrations with G Suite and Office 365.",
    "Our first on-premise edition is officially released and available to select customers.",
    "The new performance monitoring feature set has launched for all Pro and Enterprise customers.",
    "We have launched a new referral program feature that is now visible in customer accounts.",
    "Today marks the public beta launch of our AI summarization feature.",
    "Release announcement: we now support real-time webhooks; the feature is live.",
    "We’ve just shipped a new customer-facing feature: in-app product tours are now available.",
    "Our new data export tooling is live as part of the 5.0 release.",
    "Announcing the general availability of our multi-language UI; customers can switch languages now.",
    "We are launching our new admin console experience for all existing customers this week.",
    "Our latest feature, project templates, is now live and available across all plans.",
    "We’ve officially released the new reporting API as part of today’s update.",
    "Our long-awaited Teams functionality is now shipping in the latest release.",
    "Product release: the new analytics pipeline is now enabled in all production environments.",
    "We’ve launched our updated checkout flow, which is now in production for all users.",
    "Announcing the global rollout of our new search experience, now available to every account.",
    "The new user provisioning feature via SCIM is now generally available.",
    "We’re publicly announcing the launch of our new startup plan and pricing for early-stage companies."
  ],
  "negative_samples": [
    "We’re planning to launch a new feature later this year, no timeline yet.",
    "Roadmap discussion: potential ideas for next quarter’s product initiatives.",
    "Here is a draft concept for a possible new product we might explore.",
    "Brainstorming some future features we could add to improve engagement.",
    "Can someone review the spec for a hypothetical new integration?",
    "We should think about repositioning the product in our messaging.",
    "Internal proposal: maybe we should add dark mode sometime this year.",
    "Design mockups for a potential redesign, not scheduled for release yet.",
    "Collecting feedback on what features users would like to see in the future.",
    "Here are some early wireframes for an experiment we’re running only internally.",
    "We deployed a minor patch to fix a typo in the settings page.",
    "Just a small performance tweak, no user-facing changes.",
    "Pushed a hotfix to resolve a logging issue in production.",
    "Bug fix release: corrected an issue with password reset emails.",
    "We’re updating internal APIs, no visible changes for customers.",
    "Daily standup summary: engineering blockers and sprint tasks.",
    "Sprint planning notes for the upcoming development cycle.",
    "Retrospective notes from the last sprint, nothing customer-facing.",
    "Random chat about weekend plans and hobbies.",
    "Good morning team, hope everyone is doing well.",
    "Thanks for helping debug the issue earlier.",
    "FYI: the staging environment will be restarted tonight.",
    "Please review the updated unit tests for the new module.",
    "QA has signed off on the build; we will schedule release later.",
    "We’re running an internal test of the new feature; it is not available to customers yet.",
    "Internal beta only: do not communicate externally.",
    "We’re disabling an old experiment that never went public.",
    "Marketing is drafting messaging for a future product launch (no launch today).",
    "Draft blog outline for when we eventually launch the new feature.",
    "Collecting data to decide if we should sunset the legacy product.",
    "User research summary about potential needs for a future product line.",
    "We need volunteers for user interviews on a feature we might build.",
    "Please update the documentation to reflect the existing features.",
    "Reminder: update release notes for the last patch release (bug fixes only).",
    "We’re preparing assets and collateral for an upcoming announcement next month.",
    "Sales enablement session to discuss how to talk about the existing product.",
    "Design review: evaluating three concepts for a potential future homepage.",
    "Just a quick change to adjust copy in the onboarding email.",
    "We refactored some backend services to improve reliability, customers won’t notice.",
    "Updated toolkit for internal developer productivity, not part of the product.",
    "We are sunsetting an internal tool used only by our team.",
    "Internal change: switched our CI provider; no customer impact.",
    "We added more logging to troubleshoot an incident, no feature changes.",
    "Security review notes for an upcoming feature (not released).",
    "We are shifting the target date for the next major release, details to follow.",
    "Please do not mention the upcoming launch externally until we share the final date.",
    "Marketing campaign: promoting an existing feature set, no new product.",
    "Customer success wants a training session on current features only.",
    "We’re exploring a rename of one of the existing menus, not yet finalized.",
    "Testing a feature flag internally; it remains off for all customers.",
    "Experimenting with a small UI tweak for 1% of traffic, not a launch announcement.",
    "Internal hackathon project: experimental tool, no plan to ship to customers yet.",
    "Documenting the rollout plan for a future release; this is not a public announcement."
  ],
  "channels": [],
  "users": [],
  "vip_senders": [],
  "webhooks": [],
  "excluded_users": [],
  "reaction_threshold": 25,
  "reply_threshold": 12,
  "tags": [
    "product",
    "launches",
    "announcements",
    "release",
    "go-to-market",
    "signal-over-noise"
  ],
  "digest": {
    "schedules": [
      {
        "schedule": "daily",
        "daily_hour": 18,
        "top_n": 10,
        "min_score": 0.45
      }
    ]
  }
}
