{
  "id": 3005,
  "name": "Regulatory & Compliance Updates",
  "description": "Surfaces impactful, externally driven regulatory changes, enforcement actions, and compliance obligations that materially affect product, governance, risk, and legal teams.",
  "enabled": false,
  "threshold": 0.76,
  "positive_weight": 1.0,
  "negative_weight": 0.12,
  "positive_samples": [
    "The EU Commission just adopted new GDPR cross-border data transfer requirements effective March 2025.",
    "New CCPA/CPRA amendments require explicit opt-out buttons for behavioral advertising by year-end.",
    "The FTC announced new rules prohibiting dark patterns related to subscription sign-ups and cancellations.",
    "SEC releases updated cybersecurity disclosure requirements for public companies, mandatory next quarter.",
    "The CMA opened a formal investigation into platform algorithmic transparency obligations.",
    "OFTC enforcement action: €32M fine issued to a SaaS provider for improper biometric data handling.",
    "New export controls imposed on advanced AI chips and model weights exceeding specific performance thresholds.",
    "The UK ICO issued updated guidance on children's data processing for online services.",
    "A landmark ruling determined that vendors may be directly liable for negligent AI model deployment.",
    "NIST just published the new AI Risk Management Framework 1.1 with mandatory adoption dates for federal vendors.",
    "Updated PCI-DSS 4.0 requirements mandate multi-factor authentication for all administrative accounts.",
    "The Digital Markets Act (DMA) has expanded its gatekeeper obligations with new interoperability mandates.",
    "The EU AI Act final text requires conformity assessments for high-risk AI systems starting in 2026.",
    "The FCC announced new privacy rules for telecom providers handling location data.",
    "A new FINRA rule requires more stringent audit trails for automated trading algorithms.",
    "France's CNIL published enforcement guidance for LLM-based products offering user profiling.",
    "New HIPAA Security Rule updates require revisions to audit logging and data retention policies.",
    "The German federal court issued a precedent limiting automated decision-making for employment screening tools.",
    "An updated sanctions list affects cloud service exports to specific restricted jurisdictions.",
    "The White House issued an executive order on AI safety requiring transparency reports from model developers.",
    "OSHA introduced new reporting obligations for workplace sensors and monitoring technologies.",
    "New EU ePrivacy revamp includes mandatory cookie-less consent flows for targeted advertising.",
    "Singapore PDPC announced new penalties for cross-border data transfers without safeguards.",
    "Brazil’s ANPD released new requirements for consent revocation workflows.",
    "The CFPB issued policy guidance on the use of alternative data and AI in lending models.",
    "A newly issued federal mandate requires certification for AI-generated financial advice systems.",
    "The European Banking Authority introduced updated operational risk guidelines for cloud outsourcing.",
    "APRA published requirements for third-party risk management for regulated financial institutions.",
    "California passed new IoT security rules requiring unique device credentials at manufacture.",
    "A new export regulation limits distribution of encryption technology above specific thresholds.",
    "The EU passed new whistleblower protection obligations affecting internal reporting channels.",
    "DOJ enforcement update: civil penalties for non-compliance with algorithmic fairness rules increased sharply.",
    "New mandatory breach notification timelines introduced for critical infrastructure providers.",
    "FERC announced new compliance standards for grid cyber vulnerability reporting.",
    "A Supreme Court ruling redefines software copyright exceptions for AI-generated code.",
    "Canada’s new privacy law (CPPA) introduces user data mobility and transparency obligations.",
    "New guidance restricts automated surveillance tools in educational technology products.",
    "The EDPB issued new interpretations of ‘legitimate interest’ affecting analytics providers.",
    "State-level biometric privacy law now mandates explicit consent for facial recognition APIs.",
    "The BIS introduced new export licensing requirements for AI training clusters.",
    "New DOJ antitrust guidance affects API access restrictions for developer ecosystems.",
    "Updated AML/KYC compliance frameworks for digital wallets become effective July 2025.",
    "A new federal procurement rule mandates accessibility certifications for SaaS vendors.",
    "Hong Kong’s PCPD published new penalties for inadequate breach response timelines.",
    "Japan’s APPI introduces restrictions on cross-context behavioral tracking.",
    "The EECC added new consumer protection rules impacting telecom product features.",
    "European Court of Justice ruling requires transparency for automated credit scoring systems.",
    "New mandatory model documentation requirements issued for AI-driven healthcare tools."
  ],
  "negative_samples": [
    "Does anyone know a good lawyer for contract reviews?",
    "Can someone send me the latest NDA template?",
    "General question: what is the difference between GDPR and CCPA?",
    "I need help understanding how to incorporate a business in Delaware.",
    "Reminder: monthly tax filings are due next week.",
    "Does anyone have a checklist for internal compliance best practices?",
    "Training session next Thursday: Introduction to Risk Management Concepts.",
    "We should update our internal compliance wiki when we get a chance.",
    "Legal team is reviewing our partner contract for renewal.",
    "We need to schedule a meeting to discuss general governance improvements.",
    "Quick question: where is the policy on employee travel expenses?",
    "Does anyone know how to file a trademark application?",
    "Here’s an article summarizing common privacy principles (educational only).",
    "We need to refresh the internal code of conduct this quarter.",
    "Can someone help me understand the basic difference between regulations vs guidelines?",
    "We should revise our onboarding training for new employees in the compliance team.",
    "Legal ops needs volunteers to help tag old documents.",
    "I need support drafting a data processing addendum for a vendor.",
    "Reminder: complete your annual compliance certification training.",
    "Does anyone know a good tool for tracking regulatory changes?",
    "We have an internal audit coming up; please prepare documentation.",
    "General meeting notes from today’s legal/compliance sync.",
    "Our team is reviewing internal access controls for quality improvements.",
    "New internal security initiative: employees must rotate passwords every 90 days.",
    "Our legal counsel wrote a guide to common privacy pitfalls—please read it.",
    "We’re hiring for a Regulatory Analyst role—please share the job post.",
    "Internal suggestion: we should tighten our vendor evaluation process.",
    "Company update: we improved our compliance dashboard UI.",
    "We need help organizing compliance documents in the shared drive.",
    "Discussion: should we restructure the legal team?",
    "Internal only: draft proposal for a future compliance strategy project.",
    "General note: we should keep an eye on upcoming regulations.",
    "We should collect feedback to improve our policies next quarter.",
    "Reminder: the legal department is hosting a webinar on basic privacy concepts.",
    "Does anyone have a template for an internal risk matrix?",
    "Can someone proofread a memo summarizing existing legal obligations?",
    "Drafting a whitepaper on regulatory trends—no immediate changes required.",
    "Brainstorming: how can we simplify our consent forms internally?",
    "Legal FYI: court hearing scheduled next month for a case we’re watching (no ruling yet).",
    "We received a routine compliance questionnaire from a vendor.",
    "We’re updating language in our internal data retention policy.",
    "Please review the internal audit plan for next year.",
    "A reminder to check license renewals for internal tools.",
    "Discussion about switching to a different external counsel.",
    "We need to upload the new internal conduct guidelines to the portal.",
    "General compliance refresher training available for new hires.",
    "Legal is conducting a periodic review of our contract templates.",
    "Here is a list of books about regulatory theory—nothing urgent."
  ],
  "channels": [],
  "users": [],
  "vip_senders": [],
  "webhooks": [],
  "excluded_users": [],
  "reaction_threshold": 8,
  "reply_threshold": 4,
  "tags": [
    "compliance",
    "regulatory",
    "legal",
    "governance",
    "risk",
    "enforcement"
  ],
  "digest": {
    "schedules": [
      {
        "schedule": "weekly",
        "weekly_day": 1,
        "weekly_hour": 9,
        "top_n": 20,
        "min_score": 0.46
      }
    ]
  }
}
