{
  "id": 3001,
  "name": "Security Vulnerabilities & Incidents",
  "description": "Surfaces confirmed or actively unfolding security vulnerabilities, exploits, breaches, and incident response alerts requiring immediate or near-term security action.",
  "enabled": false,
  "threshold": 0.5,
  "positive_weight": 1.0,
  "negative_weight": 0.08,
  "positive_samples": [
    "Critical RCE vulnerability identified in our authentication service; exploitation observed in the wild.",
    "Incident report: production database accessed by an unauthorized external IP, investigation underway.",
    "Zero-day exploit discovered in our API gateway affecting all versions prior to 4.2.1.",
    "We detected lateral movement in our internal network originating from compromised credentials.",
    "Security advisory: high-severity privilege escalation flaw enabling admin takeover via user settings endpoint.",
    "Emergency patch required: third-party library vulnerability CVE-2025-11327 impacts our core services.",
    "Confirmed data breach: customer PII leaked due to misconfigured S3 bucket with public read access.",
    "Threat intel alert: active exploitation campaign targeting our load balancer software.",
    "Malware infection detected on two production nodes; containment protocols triggered.",
    "We discovered a deserialization vulnerability enabling arbitrary code execution in the billing service.",
    "Our TLS termination proxy is affected by a newly disclosed crypto weakness—mitigation required ASAP.",
    "DDoS attack underway; upstream provider has activated emergency mitigation.",
    "Suspicious file integrity changes detected in the payments microservice; possible compromise.",
    "A new exploit chain allows bypassing MFA on legacy accounts—blocking those flows immediately.",
    "Unauthorized admin-level API calls executed from an unrecognized device; credentials may be stolen.",
    "Internal phishing simulation triggered unintended access escalation—requires incident review.",
    "Evidence of data exfiltration detected through abnormal outbound traffic, IR team engaged.",
    "High-severity kernel vulnerability affecting all container hosts—urgent upgrade mandatory.",
    "Vendor incident notification: third-party analytics provider experienced a breach impacting shared data.",
    "CVE alert: newly published vulnerability in OpenSSL impacts our production workloads.",
    "Indicators of compromise match known APT tactics; escalating incident severity to high.",
    "Authentication token leakage detected through logs—risk of session hijacking.",
    "We identified a supply-chain compromise in a dependency used across multiple services.",
    "Critical misconfiguration exposed our internal Grafana instance to the internet.",
    "Active brute-force attack detected against admin endpoints; lockout policies triggered.",
    "New vulnerability in our mobile SDK allows interception of encrypted traffic under certain conditions.",
    "Security bulletin: sandbox escape vulnerability in our container runtime.",
    "Forensic analysis confirms malware payload installation on CI runner—rotation and clean-up required.",
    "Botnet activity detected scanning our infrastructure for a known SSRF vector.",
    "Emergency advisory: revoke all API keys issued before last week due to signing key exposure.",
    "Unauthorized deployment triggered in production via compromised pipeline credentials.",
    "Exploit POC released publicly for a vulnerability in our messaging service; patch required today.",
    "Cloud provider notified us of abnormal access to our account via compromised IAM role.",
    "Critical misrouting bug exposed internal logs to external users; incident declared.",
    "We discovered plaintext credentials committed to the repo—secrets rotation in progress.",
    "Memory corruption exploit discovered in request parsing library used by our gateway.",
    "High-severity OAuth token forgery exploit identified; revoking sessions immediately.",
    "SQL injection vulnerability confirmed in a customer-facing endpoint; patch rolling out.",
    "We detected command-and-control callbacks from a compromised internal workstation.",
    "Session fixation vulnerability identified during internal pen test; requires patch today.",
    "Report from CERT: active exploitation targeting our infrastructure components.",
    "New ransomware strain detected on an engineering workstation; isolating network segment.",
    "Unusual outbound traffic suggests possible crypto-mining deployment on compromised containers.",
    "Privilege separation failure in the deployment system allows unauthorized code pushes.",
    "Customer report confirms unauthorized password resets originating from our service.",
    "Root access gained on a staging host through exploited kernel bug—investigating blast radius.",
    "API rate-limiting bypass discovered enabling enumeration of user accounts.",
    "IoCs linked to recent APT campaign found in our telemetry—escalating response.",
    "Critical session replay vulnerability identified in mobile authentication flow."
  ],
  "negative_samples": [
    "Security update applied successfully to all servers; no incidents detected.",
    "Routine quarterly penetration test scheduled next Monday.",
    "Documenting our security best practices for new joiners.",
    "Reminder: enable 2FA on your accounts if not already enabled.",
    "Standard password reset initiated by a user request.",
    "General discussion about improving internal security culture.",
    "Internal planning meeting for next quarter’s security roadmap.",
    "We updated our threat-modeling template—please review.",
    "Security training session for onboarding new employees.",
    "Drafting guidelines for secure coding practices.",
    "A new policy proposal aims to improve endpoint hygiene.",
    "Reminder: complete your annual security training certification.",
    "We are auditing our IAM roles as part of routine maintenance.",
    "FYI: the SIEM dashboard now includes new alert categories.",
    "The security team is refining SLAs for vulnerability triage.",
    "We’re evaluating new tools for security log analysis.",
    "New documentation added to the security knowledge base.",
    "Discussion about adopting passkeys internally.",
    "We published a blog about the importance of patching (no incident).",
    "Routine configuration update on non-production clusters.",
    "Request: please review the new security-on-call rotation plan.",
    "Can someone test the new secure file-upload component?",
    "Engineering is rolling out static analysis checks in CI.",
    "We need volunteers for the next internal security workshop.",
    "Daily operational check: all dashboards green.",
    "Informational: new compliance requirement unrelated to security incidents.",
    "We renewed our enterprise antivirus subscription.",
    "General meeting notes for weekly security sync.",
    "Internal suggestion to improve monitoring alert thresholds.",
    "Performing standard access review for quarterly audit.",
    "Discussion about migrating to a new SSO provider.",
    "Implemented a new policy requiring screen lock after 5 minutes.",
    "We updated the internal wiki about phishing awareness.",
    "Exploring vendors for a future bug bounty program.",
    "Internal request to review a new encryption library.",
    "Security interview loop scheduled for candidate next week.",
    "We added new dashboards to monitor normal workload behavior.",
    "General note: staying aware of new CVEs is important.",
    "Routine patch deployment for development environment.",
    "We turned on additional logging features for observability.",
    "Internal AMA about red team practices—no incidents involved.",
    "Idea: create a training module about supply chain risks.",
    "We need to clean up unused IAM roles in staging.",
    "Reminder: don’t share passwords over Slack.",
    "Evaluation of a new endpoint detection tool (no incident).",
    "We’re updating our TLS configuration to follow best practices.",
    "Testing new SAST rules against a sample repo.",
    "Security team is preparing updated runbooks for incident response.",
    "Refactoring secure storage code to follow guidelines.",
    "Discussing ways to reduce false positives in alerting."
  ],
  "channels": [],
  "users": [],
  "vip_senders": [],
  "webhooks": [],
  "excluded_users": [],
  "reaction_threshold": 8,
  "reply_threshold": 4,
  "tags": [
    "security",
    "threat-intel",
    "incident-response",
    "vulnerability",
    "zero-day",
    "breach"
  ],
  "digest": {
    "schedules": [
      {
        "schedule": "hourly",
        "top_n": 15,
        "min_score": 0.5
      }
    ]
  }
}
