{
  "id": 3008,
  "name": "Technical Deep Dives",
  "description": "Identifies substantial engineering analyses, architecture explorations, performance investigations, and complex systems discussions that provide high-value technical insight.",
  "enabled": false,
  "threshold": 0.74,
  "positive_weight": 1.0,
  "negative_weight": 0.25,
  "positive_samples": [
    "Comprehensive breakdown of our microservices topology, including inter-service communication patterns, deployment architecture, and scaling bottlenecks.",
    "Deep dive into our Redis Cluster migration: architectural rationale, shard distribution algorithm, failure scenarios, and performance outcomes.",
    "Technical retrospective analyzing the root cause of database latency, detailing slow query patterns, index redesign, and phased rollout improvements.",
    "Architecture decision record describing our transition from REST to GraphQL, including schema design trade-offs and federated gateway implementation.",
    "High-detail performance benchmark report comparing our legacy job scheduler with the new event-driven orchestrator.",
    "In-depth analysis of our stream processing pipeline using Kafka and Flink, including state store design and backpressure handling.",
    "Case study: how we reduced cold start latency in our serverless stack with compiler-level optimizations and container reuse.",
    "Thorough explanation of our distributed tracing system implementation, including sampling strategies and propagation mechanics.",
    "Post-mortem on our storage subsystem rewrite: lessons learned from adopting LSM trees and refactoring compaction logic.",
    "Exploration of our multi-region failover architecture, quorum behavior, and network partition mitigation techniques.",
    "Detailed engineering write-up on the new caching invalidation framework and consistency guarantees across services.",
    "Analysis of concurrency challenges inside our job execution engine, including lock contention metrics and mitigation strategies.",
    "Review of our gRPC adoption journey: performance comparisons, schema evolution challenges, and service mesh integration.",
    "Documentation of how we refactored the auth layer to support token introspection, edge caching, and zero-downtime rollout.",
    "Comprehensive comparison of load balancing algorithms (round robin, consistent hashing, EWMA) with measured results in our environment.",
    "Lessons learned from implementing idempotency across our payment workflows, including database design patterns and retry semantics.",
    "Long-form write-up on the design and implementation of our custom metrics ingestion service with a columnar storage backend.",
    "Deep technical analysis of how we achieved 40% CPU reduction by optimizing goroutine scheduling and reducing allocation churn.",
    "Architecture whitepaper: building our next-generation multi-tenant isolation model with security and performance trade-offs.",
    "Fully detailed exploration of our event-sourcing adoption, snapshot techniques, and operational considerations.",
    "Retrospective describing our migration to a shared-nothing architecture and how it impacted scaling limits.",
    "Design notes on implementing an adaptive rate limiter using token buckets and real-time feedback loops.",
    "Explainer on our approach to deterministic testing of distributed systems using virtual time and simulated failures.",
    "Engineering deep dive on redesigning the message queue backoff algorithm to reduce thundering herd effects."
  ],
  "negative_samples": [
    "How do I install this npm package?",
    "Beginner question: what does this error mean?",
    "Does anyone know the syntax for a Python dictionary?",
    "I can't get my environment variables to load; any quick tips?",
    "What’s the right way to declare a function in JavaScript?",
    "Can someone help debug this null pointer exception?",
    "Why isn’t my code compiling? Here is the error.",
    "Looking for a simple tutorial on how promises work.",
    "How do I center a div in CSS?",
    "Quick question about using Git branches.",
    "Anyone know how to fix my Dockerfile? Basic configuration only.",
    "New hire question: how do I run the backend locally?",
    "Does anyone know a good intro guide to Kubernetes?",
    "Is there an easier way to write this SQL JOIN?",
    "Why is my local build failing after a package update?",
    "General discussion about coding style preferences.",
    "Request for basic documentation on how our CI works.",
    "Simple question: how do I test this REST endpoint?",
    "Does anyone know how to use curl for POST requests?",
    "My laptop is running out of disk space—any tips?",
    "Can someone help me troubleshoot local DNS issues?",
    "Looking for a quick explanation of environment variables.",
    "Does anyone know how to generate SSH keys?",
    "Trying to remember the command to check disk usage.",
    "Can someone show me how to write a unit test for this function?",
    "What's the standard format for JSON again?",
    "How do I add a dependency to this project?",
    "What’s the difference between npm and yarn?",
    "General chat: which IDE do you prefer?",
    "I forgot how to start our dev server—anyone?"
  ],
  "channels": [],
  "users": [],
  "vip_senders": [],
  "webhooks": [],
  "excluded_users": [],
  "reaction_threshold": 15,
  "reply_threshold": 8,
  "tags": [
    "engineering",
    "architecture",
    "technical",
    "systems",
    "deep-dive",
    "learning"
  ],
  "digest": {
    "schedules": [
      {
        "schedule": "weekly",
        "weekly_day": 5,
        "weekly_hour": 17,
        "top_n": 15,
        "min_score": 0.4
      }
    ]
  }
}
