{
  "id": 3006,
  "name": "User Frustration & Pain Points",
  "description": "Detects strong user frustration signals, repeated complaints, friction-heavy workflows, and narratives indicating breakdowns in usability, reliability, or support experience.",
  "enabled": false,
  "threshold": 0.73,
  "positive_weight": 1.0,
  "negative_weight": 0.22,
  "positive_samples": [
    "I’ve spent over an hour trying to complete this and it still won’t work — extremely frustrating.",
    "This is way more complicated than it should be. I keep clicking around and nothing makes sense.",
    "Why does this feature break every time I try to use it? I’m honestly getting tired of this.",
    "This is the third time this month the app has crashed on me — completely unacceptable.",
    "I can’t believe how long it takes to do something that should be simple. Really poor experience.",
    "The onboarding flow is so confusing that new users on my team keep giving up halfway.",
    "I’ve had to redo the same task multiple times because the system keeps losing my progress.",
    "I’m stuck again. Every time I try this action I get an error with no explanation.",
    "This design is so unintuitive that I feel like I'm guessing at every step.",
    "Why is the settings panel hidden in such an obscure place? I wasted 20 minutes looking for it.",
    "The workflow is so clunky that it adds hours to my day. It desperately needs an overhaul.",
    "I'm constantly running into bugs — it's making it impossible to rely on this tool.",
    "Every time there’s an update, something breaks. This is becoming incredibly annoying.",
    "The system keeps logging me out randomly and I lose everything I was working on.",
    "The search function never returns what I need. It’s completely useless.",
    "This UI is so inconsistent — buttons move around, labels change, nothing behaves predictably.",
    "I can’t complete this task unless I find some weird workaround. It shouldn’t be this difficult.",
    "The support instructions didn’t help at all. I’m still stuck and more irritated than before.",
    "I’ve reported this issue multiple times and it still hasn’t been fixed.",
    "It shouldn’t take a power user to figure this out. The learning curve is ridiculous.",
    "I’m so confused about how this flow works that I had to ask three people for help.",
    "The app freezes every few minutes. It's practically unusable.",
    "Navigation is so unintuitive that I feel lost every time I open the app.",
    "The error messages are totally meaningless. I have no idea what I'm supposed to do next.",
    "I’m honestly close to giving up — I can’t get anything done with the tool in this state.",
    "Why does this take so many clicks? This workflow is infuriatingly slow.",
    "It feels like every step is a battle. Nothing works the way you expect.",
    "The mobile version is a nightmare — constant glitches and layout issues.",
    "I shouldn't need to read a manual just to perform a basic action.",
    "I've retried this four times and it still fails—this is ridiculous.",
    "The product keeps timing out when I'm halfway through a task. It's infuriating."
  ],
  "negative_samples": [
    "Thanks, everything worked great once I understood it.",
    "Feature is working smoothly for me.",
    "Just a small suggestion if you’re considering future updates.",
    "Quick clarification on how this part works.",
    "Appreciate the fast response from support!",
    "General comment: liking the improvements in the latest release.",
    "Curious if there’s a more efficient way to complete this step — not urgent.",
    "No major issues, just wanted to share a thought.",
    "Simple question: where can I find this feature?",
    "Minor inconvenience but nothing blocking.",
    "Just confirming the workflow behaves as expected.",
    "Sharing feedback: could be slightly more intuitive, but overall fine.",
    "Is there documentation on this? Not a problem, just looking to learn.",
    "Thanks for the fix earlier — everything is running well now.",
    "General interest in upcoming UX updates — no concerns.",
    "I’d like to suggest a small enhancement for a smoother process.",
    "No frustration here, just trying to better understand the behavior.",
    "Everything loaded correctly after refreshing; all good now.",
    "The new layout looks nice — just getting used to it.",
    "Quick usage tip for others, not a complaint."
  ],
  "channels": [],
  "users": [],
  "vip_senders": [],
  "webhooks": [],
  "excluded_users": [],
  "reaction_threshold": 10,
  "reply_threshold": 5,
  "tags": [
    "product",
    "ux",
    "feedback",
    "user-research",
    "friction",
    "pain-points"
  ],
  "digest": {
    "schedules": [
      {
        "schedule": "daily",
        "daily_hour": 16,
        "top_n": 20,
        "min_score": 0.43
      }
    ]
  }
}
